Documents/ongoing-reflection.org
* Difference between reflection and evaluation
- Reflection simply looks back on something, and may comment on what should be done in the future /but doesn't make comments on quality/
- Evaluation makes comments on how well stuff went, but it doesn't really comment on future action

It's important to both reflect on and evaluate the EPQ continuously.

* Where will this happen?
- Throughout the project it's important to reflect to know how to improve and what you do next
- There are designated 'evaluation' points, for example the peer-review, mid-project-review and final evaluation

* Extra notes
- Teachers & mentors /cannot/ provide written evaluation to include in your project
