Documents/ongoing-reflection.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Skyler Turner's EPQ</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.min.css" /><link rel="stylesheet" href="/custom.css" />
</head>
<body>
<div id="preamble" class="status">

<div class="header">
    <span class="title">Skyler Turner's EPQ</span>
    <div class="links">
        <a href="/">Home</a>
        <a href="/Notes/daily/2022-01-23.html">Latest daily</a>
        <a href="https://github.com/Minion3665/EPQ/issues/new">Report issue</a>
        <a href="https://github.com/Minion3665/EPQ">View source</a>
    </div>
</div>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbddf2f4">Difference between reflection and evaluation</a></li>
<li><a href="#org08bc2b5">Where will this happen?</a></li>
<li><a href="#org110d990">Extra notes</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbddf2f4" class="outline-2">
<h2 id="orgbddf2f4">Difference between reflection and evaluation</h2>
<div class="outline-text-2" id="text-orgbddf2f4">
<ul class="org-ul">
<li>Reflection simply looks back on something, and may comment on what should be done in the future <i>but doesn't make comments on quality</i></li>
<li>Evaluation makes comments on how well stuff went, but it doesn't really comment on future action</li>
</ul>

<p>
It's important to both reflect on and evaluate the EPQ continuously.
</p>
</div>
</div>

<div id="outline-container-org08bc2b5" class="outline-2">
<h2 id="org08bc2b5">Where will this happen?</h2>
<div class="outline-text-2" id="text-org08bc2b5">
<ul class="org-ul">
<li>Throughout the project it's important to reflect to know how to improve and what you do next</li>
<li>There are designated 'evaluation' points, for example the peer-review, mid-project-review and final evaluation</li>
</ul>
</div>
</div>

<div id="outline-container-org110d990" class="outline-2">
<h2 id="org110d990">Extra notes</h2>
<div class="outline-text-2" id="text-org110d990">
<ul class="org-ul">
<li>Teachers &amp; mentors <i>cannot</i> provide written evaluation to include in your project</li>
</ul>
</div>
</div>
</div>
</body>
</html>
